; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-88)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc12)
    (at car1 loc11)
    (at car2 loc3)
    (at car3 loc5)
    (at car4 loc2)
    (at car5 loc12)
    (at car6 loc6)
    (at car7 loc5)
    (at car8 loc13)
    (at car9 loc1)
    (at car10 loc5)
    (at car11 loc6)
    (at car12 loc1)
    (at car13 loc10)
    (at car14 loc8)
    (at car15 loc9)
    (at car16 loc10)
    (at car17 loc6)
    (at car18 loc10)
)
 (:goal (and 
(at car1 loc14)
(at car2 loc10)
(at car3 loc3)
(at car4 loc11)
(at car5 loc11)
(at car6 loc13)
(at car7 loc10)
))
)

; plan
1. (board car5 loc12)
   deleted: (at car5 loc12) (empty-ferry)
   added: (on car5)
   goals met: 0 of 7
2. (sail loc12 loc11)
   deleted: (at-ferry loc12)
   added: (at-ferry loc11)
   goals met: 0 of 7
3. (debark car5 loc11)
   deleted: (on car5)
   added: (at car5 loc11) (empty-ferry)
   goals met: 1 of 7
4. (board car1 loc11)
   deleted: (at car1 loc11) (empty-ferry)
   added: (on car1)
   goals met: 1 of 7
5. (sail loc11 loc14)
   deleted: (at-ferry loc11)
   added: (at-ferry loc14)
   goals met: 1 of 7
6. (debark car1 loc14)
   deleted: (on car1)
   added: (at car1 loc14) (empty-ferry)
   goals met: 2 of 7
7. (sail loc14 loc2)
   deleted: (at-ferry loc14)
   added: (at-ferry loc2)
   goals met: 2 of 7
8. (board car4 loc2)
   deleted: (at car4 loc2) (empty-ferry)
   added: (on car4)
   goals met: 2 of 7
9. (sail loc2 loc11)
   deleted: (at-ferry loc2)
   added: (at-ferry loc11)
   goals met: 2 of 7
10. (debark car4 loc11)
   deleted: (on car4)
   added: (at car4 loc11) (empty-ferry)
   goals met: 3 of 7
11. (sail loc11 loc6)
   deleted: (at-ferry loc11)
   added: (at-ferry loc6)
   goals met: 3 of 7
12. (board car6 loc6)
   deleted: (at car6 loc6) (empty-ferry)
   added: (on car6)
   goals met: 3 of 7
13. (sail loc6 loc13)
   deleted: (at-ferry loc6)
   added: (at-ferry loc13)
   goals met: 3 of 7
14. (debark car6 loc13)
   deleted: (on car6)
   added: (at car6 loc13) (empty-ferry)
   goals met: 4 of 7
15. (sail loc13 loc5)
   deleted: (at-ferry loc13)
   added: (at-ferry loc5)
   goals met: 4 of 7
16. (board car3 loc5)
   deleted: (at car3 loc5) (empty-ferry)
   added: (on car3)
   goals met: 4 of 7
17. (sail loc5 loc3)
   deleted: (at-ferry loc5)
   added: (at-ferry loc3)
   goals met: 4 of 7
18. (debark car3 loc3)
   deleted: (on car3)
   added: (at car3 loc3) (empty-ferry)
   goals met: 5 of 7
19. (board car2 loc3)
   deleted: (at car2 loc3) (empty-ferry)
   added: (on car2)
   goals met: 5 of 7
20. (sail loc3 loc10)
   deleted: (at-ferry loc3)
   added: (at-ferry loc10)
   goals met: 5 of 7
21. (debark car2 loc10)
   deleted: (on car2)
   added: (at car2 loc10) (empty-ferry)
   goals met: 6 of 7
22. (sail loc10 loc5)
   deleted: (at-ferry loc10)
   added: (at-ferry loc5)
   goals met: 6 of 7
23. (board car7 loc5)
   deleted: (at car7 loc5) (empty-ferry)
   added: (on car7)
   goals met: 6 of 7
24. (sail loc5 loc10)
   deleted: (at-ferry loc5)
   added: (at-ferry loc10)
   goals met: 6 of 7
25. (debark car7 loc10)
   deleted: (on car7)
   added: (at car7 loc10) (empty-ferry)
   goals met: 7 of 7
